# Brewfile - Homebrew Package Manifest
# Install all packages: brew bundle install
# Update: brew upgrade

# Modern CLI Tools (Rust-based replacements)
brew "bat"          # cat with syntax highlighting
brew "eza"          # Modern ls replacement
brew "fd"           # Modern find replacement
brew "ripgrep"      # Modern grep replacement (rg)
brew "ast-grep"     # AST-based structural code search (sg)
brew "fzf"          # Fuzzy finder
brew "yazi"         # Terminal file manager
brew "zoxide"       # Smarter cd command

# Git Tools
brew "git-delta"    # Better git diff viewer
brew "difftastic"   # Structural diff tool (alternative to delta)
brew "lazygit"      # Terminal UI for git commands
brew "gh"           # GitHub CLI
brew "glab"         # GitLab CLI

# Password Manager
brew "bitwarden-cli"  # Bitwarden CLI for password management

# Terminal Multiplexer
brew "tmux"         # Terminal multiplexer for session management

# Utilities
brew "jq"           # JSON processor
brew "glow"         # Markdown viewer
brew "rich-cli"     # Rich terminal output (JSON, CSV, markdown, syntax)
brew "btop"         # Resource monitor with beautiful TUI
brew "htop"         # Interactive process viewer
brew "micro"        # Modern terminal text editor
brew "lazydocker"   # Terminal UI for docker commands
brew "xclip"        # X11 clipboard utility (required for clipboard ops in terminals)
brew "moor"         # Nice pager for humans (better less)
brew "Valkyrie00/homebrew-bbrew/bbrew"  # Terminal UI for managing Homebrew packages

# MCP Tools
brew "f/mcptools/mcp"     # CLI for inspecting and debugging MCP servers

# Development Tools
brew "oven-sh/bun/bun"    # JavaScript runtime, bundler, and package manager
brew "fnm"                # Fast Node.js version manager
brew "uv"                 # Fast Python package manager
brew "composer"           # PHP dependency manager

# Prompt & Shell
brew "oh-my-posh"   # Prompt theme engine
brew "bash-completion@2"  # Programmable completion for Bash 4.2+
