# Brewfile - Homebrew Package Manifest
# Install all packages: brew bundle install
# Update: brew upgrade

# Modern CLI Tools (Rust-based replacements)
brew "bat"          # cat with syntax highlighting
brew "eza"          # Modern ls replacement
brew "fd"           # Modern find replacement
brew "ripgrep"      # Modern grep replacement (rg)
brew "fzf"          # Fuzzy finder
brew "yazi"         # Terminal file manager
brew "zoxide"       # Smarter cd command

# Git Tools
brew "git-delta"    # Better git diff viewer
brew "difftastic"   # Structural diff tool (alternative to delta)
brew "lazygit"      # Terminal UI for git commands
brew "gh"           # GitHub CLI

# Utilities
brew "jq"           # JSON processor
brew "glow"         # Markdown viewer
brew "btop"         # Resource monitor with beautiful TUI
brew "htop"         # Interactive process viewer
brew "micro"        # Modern terminal text editor
brew "lazydocker"   # Terminal UI for docker commands
brew "xclip"        # X11 clipboard utility (required for clipboard ops in terminals)

# Development Version Managers
brew "fnm"          # Fast Node.js version manager
brew "uv"           # Fast Python package manager

# Prompt & Shell
brew "oh-my-posh"   # Prompt theme engine
brew "bash-completion@2"  # Programmable completion for Bash 4.2+

# Build Tools (optional, for compiling from source if needed)
# brew "gcc"
